{
  "help": {
    "overview":"## Übersicht über den GS1 Assistant\n\n\n\n**GS1 Assistant** ist eine leistungsstarke Shopify-App, die die Zuweisung und Verwaltung von Produktidentifikationscodes wie **GTIN-14, UPC und EAN** für Shopify-Händler vereinfacht.\n\n\n\nDiese weltweit anerkannten Codes sind unverzichtbar für Unternehmen, die internationale Standards einhalten und mit großen Einzelhändlern, Marktplätzen und Distributoren zusammenarbeiten müssen.\n\nDie App integriert sich direkt in **GS1-APIs, sofern verfügbar**. So können Händler ihren Produkten automatisch eindeutige GTINs zuweisen, die Einhaltung der Händleranforderungen sicherstellen und die Produktrückverfolgbarkeit verbessern.\n\nMit Funktionen wie der **Massen-GTIN-Zuweisung**, exportierbaren Daten in **GS1-zugelassenen Formaten** und der direkten API-Integration mit **GS1 Deutschland** _(weitere Regionen folgen)_ macht GS1 Assistant die Verwaltung der Produktidentifikation **einfach, effizient und skalierbar**.\n\nOb Sie einen **kleinen Produktkatalog** oder **Tausende von Varianten** verwalten, GS1 Assistant gibt Ihnen die volle Kontrolle über Ihre Produktcodes und bietet eine effiziente Möglichkeit, die Einhaltung globaler Standards zu gewährleisten.",
"mainpage":"## Startseite\n\n\n\n Verwalten und generieren Sie offizielle GS1 GTINs und UPCs direkt in Shopify. Dieses Tool unterstützt Sie bei der Einhaltung der Einzelhandelsvorschriften durch die Verbindung mit GS1 US. So stellen Sie sicher, dass Ihre Barcodes verifizierbar und von großen Einzelhändlern wie Amazon und Walmart als vertrauenswürdig eingestuft werden. Egal, ob Sie bereits ein GS1-Firmenpräfix besitzen oder eines benötigen, diese App führt Sie schnell und präzise durch den Prozess.\n\n![screenshot:Landed Page](landedpage.png)",
"configuration": "## Konfiguration\n\n\n\nDer erste Schritt bei der Verwendung der GS1 Assistant App ist die Konfiguration der Einstellungen, die bestimmen, wie Ihre GTINs zugewiesen und verwaltet werden.\n\nDieser Abschnitt führt Sie durch die Verwaltung des Firmenpräfixes und die Konfiguration der App-Sprache.\n\n![screenshot:Erste Schritte](GetStarted.png)\n\n **Firmenpräfix verwalten**\n\n Verwenden Sie Ihr eigenes, von GS1 zugewiesenes globales Firmenpräfix (GPC), um GTINs zu generieren.\n\nEin Firmenpräfix wird zugewiesen, wenn Sie Barcodes über GS1 kaufen.\n\nDazu müssen Sie Ihr GCP eingeben, das GTIN-Format (UPC/EAN/GTIN-14) angeben und den Bereich der zu verwendenden GTINs konfigurieren.\n\n![screenshot:Firmenpräfix verwalten](ManageCompanyPrefix.png)\n\n![screenshot:Neues Firmenpräfix](NewCompanyPrefix.png)\n\n **GS1-Firmenpräfix aktualisieren**\n\nSie können ein vorhandenes Firmenpräfix, um bestimmte Bereiche für GTINs festzulegen, die Ihren Produkten zugewiesen werden sollen\n\n1. Öffnen Sie den GS1-Konfigurationsbildschirm:**\n\n Klicken Sie in der Liste neben dem Firmenpräfix, das Sie aktualisieren möchten, auf die Schaltfläche „Bearbeiten“. \n\n **2. Firmenpräfix und Blockgröße:**\nDie Felder „Firmenpräfix“ und „Blockgröße“ sind vorausgefüllt und schreibgeschützt. Diese Felder zeigen das Präfix und die Größe des zugewiesenen Blocks an und können nach der Erstkonfiguration nicht mehr geändert werden. \n\n **3. Sequenzbereiche:** Sie können optional Sequenzbereiche für GTIN-Zuweisungen definieren. Diese Bereiche geben die Reihenfolge oder Sequenz an, in der GTINs den Produktvarianten aus Ihrem Firmenpräfixblock zugewiesen werden. Beachten Sie, dass die Sequenzbereiche nicht die eigentlichen GTIN-Nummern, sondern die internen Sequenzpositionen innerhalb des Blocks darstellen. \n\n&nbsp;&nbsp; **Start:** Geben Sie die Startsequenznummer ein. Dies ist die erste Position im Firmenpräfixblock, ab der mit der GTIN-Zuweisung begonnen wird. \n\n&nbsp;&nbsp; **Ende:** Geben Sie die Endsequenznummer ein. Dies ist die letzte Sequenzposition, die für GTIN-Zuweisungen verwendet wird.\n\n![screenshot:Präfix wird aktualisiert](UpdatingPrefix.png)\n\n **Verbindung zu GS1 wird hergestellt**\n\nSie können die App mit Ihrem GS1-Konto verbinden, um Firmenpräfixe und GTIN-Zuweisungen zu synchronisieren. Nach der Verbindung werden die in Ihrem GS1-Konto gespeicherten Präfixe automatisch in die App übernommen.\n\n**1. Mit GS1 verbinden:**\n\nKlicken Sie auf die Schaltfläche „Mit GS1 verbinden“, um den Vorgang zu starten. Sie müssen ein API-Token von Ihrer GS1-Einheit generieren, um die Verbindung herzustellen.\n\n**2. Firmenpräfixe synchronisieren:**\n\nNach der Verbindung werden Ihre Firmenpräfixe mit Ihrem GS1-Konto synchronisiert. In der Statusspalte wird angezeigt, ob jedes Präfix im GS1-Katalog vorhanden ist.\n\n **Hinweis:** Der Synchronisierungsvorgang überschreibt nicht Ihre lokalen Konfigurationen, sondern synchronisiert nur neue Daten von GS1.\n\n![screenshot:PrefixGrid](PrefixGrid.png)\n\n![screenshot:Connect GS1](ConnectGS1.png)\n\n**GS1-Standardeinstellungen**\n\n In diesem Abschnitt können Sie Standardproduktinformationen für die Zuweisung von GTINs (Global Trade Item Numbers) festlegen. Diese Werte helfen dabei, Ihre Produktlisten in GS1-kompatiblen Systemen und Marktplätzen zu standardisieren.\n\n![screenshot:GS1-Standardwerte](GS1Defaults.png)",
"dashboard":"## Dashboard\n\n\n\nDas Dashboard bietet einen Überblick über Ihre Produktvarianten und die zugehörigen GTINs sowie Tools für deren effiziente Verwaltung. Von dieser zentralen Stelle aus können Sie GTINs zuweisen, verfolgen und verwalten, ihren Status einsehen und Massenaktionen durchführen.\n\n**GTIN-Status und -Verwaltung**\n\nDie Seite **GTIN-Status** bietet Ihnen eine detaillierte Übersicht über die Ihren Produktvarianten zugewiesenen GTINs. Sie können Varianten nach GTIN-Status filtern, um Ihren Bestand einfach zu verwalten und die Einhaltung der GS1-Standards sicherzustellen.\n\n **Statusfilter:** Nutzen Sie die Filteroptionen, um zwischen verschiedenen Status zu navigieren:\n\n&nbsp;&nbsp; **Zugewiesen:** Zeigt Produkte an, denen gültige GTINs zugewiesen sind.\n\n**Nicht zugewiesen:** Zeigt Produkte an, denen noch keine GTIN zugewiesen ist.\n\n **Gültig:** Zeigt GTINs an, die das erforderliche Format aufweisen und den GS1-Standards entsprechen, sodass sie auf allen unterstützten Plattformen verwendet werden können.\n\n**Ungültig:** Hebt alle GTINs hervor, die nicht dem erforderlichen Format oder den GS1-Standards entsprechen.\n\n**Duplikate:** Zeigt alle GTINs an, die in verschiedenen Varianten dupliziert sind.\n\n**GTIN-Sperrstatus:** Zusätzlich zum Produktstatus.\n\n **Verfügbar:** Zeigt die Gesamtzahl der verbleibenden GTINs im konfigurierten Firmenpräfixblock an, sodass Sie den Überblick darüber behalten, wie viele GTINs noch zugewiesen werden können.\n\n&nbsp;&nbsp;**Ausstehend Shopify:** GTINs, die zugewiesen wurden, sich aber noch im Prozess der Synchronisierung oder Annahme durch Shopify befinden.\n\n &nbsp;&nbsp; **Ausstehend GS1:** Zur Validierung übermittelte GTINs, die auf Bestätigung oder Verifizierung durch GS1 warten.\n\n &nbsp;&nbsp;**Downloads:** GTINs, die zur Verwendung in externen Systemen oder Aufzeichnungen exportiert oder heruntergeladen wurden.\n\n**Manuelle und automatische Aktualisierung**\n\nDas Dashboard zeigt den Zeitpunkt der letzten Aktualisierung der GTIN-Daten an, sodass Sie die letzten Änderungen verfolgen können. Eine manuelle Aktualisierung kann über die Schaltfläche „Aktualisieren“ oben im Dashboard ausgelöst werden.\n\n &nbsp;&nbsp;**Automatische Aktualisierung:** Nach jeder Aktion, z. B. dem Zuweisen oder Aufheben der Zuweisung von GTINs, wird das Dashboard automatisch aktualisiert, um den aktualisierten Produktstatus anzuzeigen.\n\n&nbsp;&nbsp;**Manuelle Aktualisierung:** Bei Bedarf können Sie die Seite jederzeit manuell über die Schaltfläche „Aktualisieren“ aktualisieren, um den Status und die Produktliste zu aktualisieren.\n\n**Hinweis:** Bei Geschäften mit einer großen Anzahl von Produkten kann der Aktualisierungsvorgang je nach Größe Ihres Katalogs einige Zeit in Anspruch nehmen.\n\n**Katalogstatus:**\n\n&nbsp;&nbsp;Die Spalte „Status“ zeigt an, ob die GTIN des Produkts im GS1-Katalog vorhanden ist.\n\n&nbsp;&nbsp;**GTIN-Status:** Gibt den Validierungsstatus der GTIN (Global Trade Item Number) gegenüber dem GS1 Global Data Synchronization Network an (GDSN)\n\n&nbsp;&nbsp;**Verifiziert:** Gibt an, ob die GTIN des Produkts und die zugehörigen Attribute (Marke, Beschreibung usw.) durch den Dienst „Verified by GS1“ validiert wurden\n\n![screenshot:Dashboard](Dashboard.png)\n\n**GTINs zuweisen und aufheben**\n\nDas Dashboard ermöglicht Ihnen die Zuweisung und Aufhebung von GTINs direkt aus der Variantenliste. Sie können dies einzeln oder in großen Mengen tun, was die Verwaltung großer Produktkataloge erleichtert.\n\n**1. Individuelle GTIN-Zuweisung:**\n\n&nbsp;&nbsp;Neben jeder Produktvariante sehen Sie die Schaltfläche „GTIN zuweisen“. Klicken Sie auf diese Schaltfläche, um dieser Variante manuell eine GTIN zuzuweisen.\n\n![screenshot:GTINS zuweisen](AssignGTINs.png)\n\n**2. Massenzuweisung und -aufhebung von GTINs:**\n\n&nbsp;&nbsp;Sie können GTINs für mehrere Produkte gleichzeitig zuweisen oder deren Zuweisung aufheben:\n\n&nbsp;&nbsp;Wählen Sie mehrere Produktvarianten aus, indem Sie die Kontrollkästchen daneben aktivieren.\n\n&nbsp;&nbsp;Klicken Sie oben in der Liste auf die Schaltfläche **Zuweisen**, um allen ausgewählten Varianten automatisch verfügbare GTINs zuzuweisen.\n\n&nbsp;&nbsp;Um GTINs zu entfernen, verwenden Sie die Schaltfläche **Aufheben**, um die Zuweisung von GTINs zu den ausgewählten Varianten aufzuheben.\n\n![screenshot:Massen-GTINS](BulkAction.png)\n\n**Filtern und Suchen nach Varianten**\n\nDas Dashboard enthält erweiterte Filter- und Suchoptionen, mit denen Sie schnell bestimmte Produktvarianten finden:\n\n&nbsp;&nbsp;**Suchleiste (Varianten filtern):** Sie können das Suchfeld verwenden, um Schlüsselwörter, Produkttitel oder GTINs einzugeben Variantenliste. Mit dieser Funktion können Sie Produkte schnell nach Name, Beschreibung oder anderen relevanten Daten filtern. Wenn Sie beispielsweise „neu“ in die Suchleiste eingeben, wird die Liste so gefiltert, dass nur Produkte angezeigt werden, deren Titel oder Details „neu“ enthalten.\n\n**Statusfilter:**Verwenden Sie die Statusfilter (Zugewiesen, Nicht zugewiesen, Duplikate, Gültig, Ungültig), um die Liste der auf dem Dashboard angezeigten Produkte zu verfeinern.\n\n![screenshot:Filters GTINS](SearchingFilters.png)\n\n**Synchronisierung mit Ihrem GS1-Katalog**\n\nSie können Ihre Produkte auf zwei Arten mit Ihrem GS1-Katalog synchronisieren:\n\n&nbsp;&nbsp;**1. Direktverbindung:** \n\n&nbsp;&nbsp; Wenn Sie eine Direktverbindung mit Ihrer GS1-Einheit (z. B. GS1 Deutschland) konfiguriert haben, werden Ihre Produkte automatisch mit dem GS1-Katalog synchronisiert.\n\n&nbsp;&nbsp;**2. Exportieren und Importieren:** \n\n&nbsp;&nbsp; Sie können Produktdaten auch aus dem GS1 Assistant exportieren und manuell in Ihren GS1-Katalog importieren. Die App unterstützt derzeit Exportformate für **GS1 USA** und **GS1 Deutschland**.\n\n&nbsp;&nbsp;Wenn Ihre Region noch nicht unterstützt wird und Sie bei der Erweiterung der Funktionalität auf zusätzliche GS1-Einheiten helfen können, wenden Sie sich bitte an uns.\n\n![screenshot:GTINS herunterladen](DownloadModel.png)",
"variantdetail":"## Variantendetails\n\n\n\n**GTIN-Status**\n\n&nbsp;&nbsp;Zeigt die aktuelle GTIN, ihren Validierungsstatus (z. B. OK), das Firmenpräfix und die registrierten Firmendetails an. Beinhaltet die Option, die GTIN-Zuweisung aufzuheben.\n\n**Verifiziert durch GS1-Karte**\n\n&nbsp;&nbsp;Bestätigt, dass das Produkt offiziell im GS1-Register verifiziert ist. Zeigt verifizierte Details wie Beschreibung, Markenname, Kategorie, Nettoinhalt und verifiziertes Bild an.\n\n**GTIN-Manager**\n\n&nbsp;&nbsp;Ermöglicht Benutzern das Anzeigen und Bearbeiten von mit dem GS1-Katalog synchronisierten Produktdaten. Dies umfasst Kategorisierung, Sprache, Markt, Nettomenge, Verpackungsebene usw. Außerdem können diese Informationen mit GS1 synchronisiert oder aktualisiert werden.\n\n**GTIN-Protokollverlauf**\n\n&nbsp;&nbsp;Ein chronologisches Protokoll, das alle Aktionen und Synchronisierungsereignisse im Zusammenhang mit der GTIN anzeigt – wie wie Zuweisungen, Barcode-Updates, GS1-Synchronisierungen und Löschvorgänge.\n\n![screenshot:Variantendetail](VariantDetail.png)", 
"download":"## Download-Verwaltung\n\n Benutzer können zuvor heruntergeladene Dateien anzeigen und bei Bedarf erneut herunterladen.\n\n![screenshot:Downloads](Downloads.png)"
  }
}
