{
  "help": {
    "overview": "## Overview of the GS1 Assistant\n\n\n\n**GS1 Assistant** is a powerful Shopify app designed to simplify the process of assigning and managing product identification codes like **GTIN-14, UPC, and EAN** for Shopify merchants.\n\n\n\nThese globally recognized codes are essential for businesses that need to comply with international standards and work with major retailers, marketplaces, and distributors.\n\nThe app integrates directly with **GS1 APIs where available**, allowing merchants to automatically assign unique GTINs to their products, ensuring compliance with retailer requirements and improving product traceability.\n\nWith features like **bulk GTIN assignment**, exportable data in **GS1-approved formats**, and direct API integration with **GS1 Germany** _(with more regions to come)_, GS1 Assistant makes managing product identification **simple, efficient, and scalable**.\n\nWhether you?re managing a **small product catalog** or **thousands of variants**, GS1 Assistant gives you full control over your product codes and provides an efficient way to stay compliant with global standards.",
    "mainpage": "## Main Page\n\n\n\n Manage and generate official GS1 GTINs and UPCs directly within Shopify. This tool helps you stay retail-compliant by connecting with GS1 US to ensure your barcodes are verifiable and trusted by major retailers like Amazon and Walmart. Whether you already have a GS1 Company Prefix or need to get one, this app guides you through the process quickly and accurately.\n\n![screenshot:Landed Page](landedpage.png)",
    "configuration": "## Configuration\n\n\n\nThe first step in using the GS1 Assistant app is configuring the settings that determine how your GTINs are assigned and managed.\n\nThis section will guide you through manage Company prefix, and configuring the app language.\n\n![screenshot:Get Started](GetStarted.png)\n\n **Manage Company Prefix**\n\n Use your own GS1-assigned global company prefix (GPC) to generate GTINs.\n\nA company prefix is assigned when you purchase barcodes through GS1\n\nThis requires entering your GCP, specifying the GTIN format (UPC/EAN/GTIN-14), and configuring the range of GTINs to be used.\n\n![screenshot:Manage Company Prefix](ManageCompanyPrefix.png)\n\n![screenshot:New Company Prefix](NewCompanyPrefix.png)\n\n **Updating a GS1 Company Prefix**\n\nYou can update an existing company prefix to set specific ranges for GTINs that should be assigned to your products\n\n **1. Open the GS1 Configuration Screen:**\n\n Click the Edit button next to the company prefix you want to update in the list.\n\n **2. Company Prefix and Block Size:**\nThe Company Prefix and Block Size fields are pre-filled and read-only. These fields show the prefix and the size of the block assigned, which cannot be changed after initial configuration.\n\n **3. Sequence Ranges:** You can optionally define sequence ranges for GTIN assignments. These ranges specify the order or sequence in which GTINs will be assigned to product variants from your company prefix block. It’s important to note that the sequence ranges are not the actual GTIN numbers, but the internal sequence positions within the block.\n\n&nbsp;&nbsp; **Start:** Enter the starting sequence number. This is the first position in the company prefix block from which GTINs will begin to be assigned.\n\n&nbsp;&nbsp; **End:** Enter the ending sequence number. This is the last sequence position that will be used for GTIN assignments.\n\n![screenshot:Updating Prefix](UpdatingPrefix.png)\n\n **Connecting to GS1**\n\nYou can connect the app to your GS1 account to sync company prefixes and GTIN assignments. Once connected, prefixes stored in your GS1 account will be automatically pulled into the app.\n\n **1.  Connect to GS1:**\n\nClick the Connect to GS1 button to start the process. You will need to generate an API token from your GS1 entity to establish the connection.\n\n**2. Sync Company Prefixes:**\n\nAfter connecting, your company prefixes will be synced with your GS1 account, and the Status column will indicate whether each prefix exists in the GS1 Catalog.\n\n **Note:** The syncing process will not overwrite your local configurations, but will only sync new data from GS1.\n\n![screenshot:PrefixGrid](PrefixGrid.png)\n\n![screenshot:Connect GS1](ConnectGS1.png)\n\n**GS1 Defaults**\n\n This section allows you to set default product information used when assigning GTINs (Global Trade Item Numbers). These values help standardize your product listings across GS1-compliant systems and marketplaces.\n\n![screenshot:GS1 Defaults](GS1Defaults.png)",
"dashboard": "## Dashboard\n\n\n\nThe Dashboard provides an overview of your product variants and their associated GTINs, along with tools to manage them efficiently. From this central hub, you can assign, track, and manage GTINs, view their statuses, and perform bulk actions.\n\n**GTIN Status and Management**\n\nThe **GTIN Status** page gives you a detailed overview of the GTINs assigned to your product variants. You can filter variants by GTIN status to easily manage your inventory and ensure compliance with GS1 standards.\n\n **Status Filters:** Use the filter options to navigate between different statuses:\n\n&nbsp;&nbsp; **Assigned:** View products that have valid GTINs assigned.\n\n&nbsp;&nbsp;**Unassigned:** View products that do not yet have a GTIN assigned.\n\n &nbsp;&nbsp;**Valid:** Indicates GTINs that meet the required format and comply with GS1 standards, making them ready for use across supported platforms.\n\n&nbsp;&nbsp;**Invalid:** Highlights any GTINs that do not conform to the required format or GS1 standards.\n\n&nbsp;&nbsp;**Duplicates:** Displays any GTINs that are duplicated across variants.\n\n**GTIN Block Status:** In addition to the product status\n\n&nbsp;&nbsp; **Available:** Shows the total number of GTINs remaining in the configured company prefix block, helping you keep track of how many GTINs can still be assigned.\n\n&nbsp;&nbsp;**Pending Shopify:** GTINs that have been assigned but are still in the process of being synced or accepted by Shopify.\n\n &nbsp;&nbsp; **Pending GS1:** GTINs submitted for validation that are awaiting confirmation or verification from GS1.\n\n &nbsp;&nbsp; **Downloads:** GTINs that have been exported or downloaded for use in external systems or records.\n\n**Manual and Automatic Refresh**\n\nThe Dashboard displays the last time the GTIN data was updated, allowing you to keep track of recent changes. A manual refresh can be triggered using the Refresh button at the top of the dashboard.\n\n &nbsp;&nbsp;**Automatic Refresh:** After any action, such as assigning or unassigning GTINs, the dashboard will automatically refresh to reflect the updated product status.\n\n&nbsp;&nbsp;**Manual Refresh:** If needed, you can manually refresh the page using the Refresh button to update the status and product list at any time.\n\n**Note:** For stores with a large number of products, the refresh process may take some time, depending on the size of your catalog.\n\n**Catalog Status:**\n\n&nbsp;&nbsp;The Status column shows whether the product’s GTIN exists in the GS1 Catalog.\n\n&nbsp;&nbsp;**GTIN Status:** Indicates the validation status of the GTIN (Global Trade Item Number) against the GS1 Global Data Synchronization Network (GDSN)\n\n&nbsp;&nbsp;**Verified:** Indicates whether the product’s GTIN and associated attributes (brand, description, etc.) have been validated through the Verified by GS1 service\n\n![screenshot:Dashboard](Dashboard.png)\n\n**Assigning and Unassigning GTINs**\n\nThe Dashboard allows you to assign and unassign GTINs directly from the variant list. You can do this either individually or in bulk, making it easier to handle large product catalogs\n\n**1. Individual GTIN Assignment:**\n\n&nbsp;&nbsp;Next to each product variant, you’ll see an Assign GTIN button. Click this button to manually assign a GTIN to that specific variant.\n\n![screenshot:Assign GTINS](AssignGTINs.png)\n\n**2. Bulk GTIN Assignment and Unassignment:**\n\n&nbsp;&nbsp;You can assign or unassign GTINs for multiple products at once:\n\n&nbsp;&nbsp;Select multiple product variants by checking the boxes next to them\n\n&nbsp;&nbsp;Click the **Assign** button at the top of the list to automatically assign available GTINs to all selected variants.\n\n&nbsp;&nbsp;To remove GTINs, use the **Unassign** button to unassign GTINs from the selected variants.\n\n![screenshot:Bulk GTINS](BulkAction.png)\n\n**Filtering and Searching for Variants**\n\nThe dashboard includes advanced filtering and search options to help you quickly locate specific product variants:\n\n&nbsp;&nbsp;**Search Bar (Filter Variants):** You can use the search box to enter keywords, product titles, or GTINs to refine the list of variants. This feature allows you to quickly filter products based on their name, description, or other relevant data. For example, entering new in the search bar will filter the list to only show products that contain new in their title ordetails.\n\n&nbsp;&nbsp;**Status Filters:** Use the status filters (Assigned, Unassigned, Duplicates, Valid, Invalid) to refine the list of products shown on the dashboard.\n\n![screenshot:Filters GTINS](SearchingFilters.png)\n\n**Synchronizing with Your GS1 Catalog**\n\nYou can synchronize your products with your GS1 Catalog in one of two ways:\n\n&nbsp;&nbsp;**1. Direct Connection:** \n\n&nbsp;&nbsp;  If you have configured a direct connection with your GS1 entity (such as GS1 Germany), your products will sync automatically with the GS1 Catalog.\n\n&nbsp;&nbsp;**2. Exporting and Importing:** \n\n&nbsp;&nbsp;  You can also export product data from GS1 Assistant and import it into your GS1 Catalog manually. The app currently supports export formats for **GS1 USA** and **GS1 Germany**.\n\n&nbsp;&nbsp;If your region is not yet supported, and you’re able to assist with expanding functionality to additional GS1 entities, please reach out to us.\n\n![screenshot:Download GTINS](DownloadModel.png)",
"variantdetail":"## Variant Detail\n\n\n\n**GTIN Status**\n\n&nbsp;&nbsp;Shows the current GTIN, its validation status (e.g., OK), company prefix, and the registered company details. Includes the option to unassign the GTIN.\n\n**Verified by GS1 Card**\n\n&nbsp;&nbsp;Confirms that the product is officially verified in the GS1 registry. Displays verified details like description, brand name, category, net content, and verified image.\n\n**GTIN Manager**\n\n&nbsp;&nbsp;Allows users to view and edit product data synced with the GS1 catalog. This includes categorization, language, market, net quantity, packaging level, etc. It also allows syncing or updating this info to GS1.\n\n**GTIN Log History**\n\n&nbsp;&nbsp;A chronological log showing all actions and sync events related to the GTIN—such as assignments, barcode updates, GS1 syncs, and clear operations.\n\n![screenshot:Variant Detail](VariantDetail.png)",
"download":"## Download Management\n\n Users can view previously downloaded files and Re-download files if needed.\n\n![screenshot:Downloads](Downloads.png)"
  }
}
